<?php
//решение задачи с помощью цикла while
$i = 100;
while($i<=149){
    if($i==100) {
        $i += $i*0.1;
        echo "В конце года:  ".$i.' руб. <br/>';
    } else {
        $i += $i*0.035;
        echo "В следующем году: ".$i.' руб. <br/>';
    }
}
//решение задачи с помощью цикла for
echo '<br>';
$b = 100;
for($i = 0; $b <=149; $i++) {
    if(!$i) {
        $b += $b*0.1;
        echo "В конце года:  ".$b.'руб. <br/>';
    } else {
        $b += $b*0.035;
        echo "Через $i года(-а, лет):  ".$b.'руб. <br/>';
    }
}